1. hn 태그 : h1 ~ h6 태그
           - 제목이나 주제와 같은 성격의 텍스트를 나타낼 때 사용하는 태그
           - 검색엔진에서 키워드로 인식하는 태그임 -> 중요!
           - 하나의 html 확장자 파일 안에서는 <h1> 태그를 하나만 사용함
2. p 태그 : 단락(문단, 문장)을 나타낼 때 사용하는 태그
           - p태그 하나당 줄바꿈 처리 됨
3. br 태그 : 줄바꿈을 하기 위해 사용하는 태그
           - 컨텐츠가 없는 태그
4. blockquote 태그 : 인용문을 나타낼 때 사용하는 태그
              - 속성 cite="참고한 Url 주소"
5. q 태그 : 간단한 인용문을 나타낼 때 사용하는 태그
          - 속성 cite="참고한 Url 주소"
6. ins 태그, del 태그
   ins 태그 : 어떠한 내용을 새롭게 삽입할 때 사용하는 태그
            - 밑줄 처리되는 태그
   del 태그 : 어떠한 내용을 삭제할 때 사용하는 태그
            - 관통하는 줄이 처리되는 태그
   - 줄바꿈 처리되지 않음
7. sub 태그, sup 태그
   sub 태그 : 아래 첨자를 표현할 때 사용하는 태그
   sup 태그 : 윗 첨자를 표현할 때 사용하는 태그
