1장
(데이터 -> 가공 -> 정보)로 만드는 기술 : IT(information Technology)
컴퓨터 : H/W + S/W
S/W : 응용 프로그램 + 시스템 S/W
응용 프로그램 : 특정 작업을 위해 사용하는 프로그램(ex : MS 워드, 곰플레이어)
시스템 S/W : 컴퓨터 H/W, 응용 프로그램을 관리하기 위한 S/W(ex : OS, 유틸리티)
OS : 컴퓨터 전체를 관리하고 운영하는 S/W - 모든 S/W 위에 존재하는 최고의 S/W
                                       - 컴퓨터 자원을 효율적으로 관리하는 S/W
                                       - S/W와 H/W의 특성을 모두 갖춘 형태로 운영 = 펌웨어(Firmware)
                                       - 커널 + 인터페이스
커널 : OS의 핵심 기능을 모아놓은 것. - 모든 컴퓨터 자원을 관리, 따라서 사용자 or 응용 프로그램은 커널을 통해서만 컴퓨터 자원에 접근 가능

OS의 역할
1. 자원 관리
2. 자원 보호
3. H/W 인터페이스 제공
4. UI 제공
